_org_posts/_posts/2021-12-27-boj-1149.org
#+HTML: ---
#+HTML: title: BOJ 1149 RBG 거리
#+HTML: tags: DP
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 1149 RGB 거리
- DP용 문제
 
** 접근하기
#+BEGIN_EXAMPLE
dp[N][0] dp[N][1] dp[N][2]   -> 각 집마다의 색깔

N+1이 0이면 N에서는 1, 2만 가능

N+1이 1이면 N에서는 0, 2만 가능

N+1이 2이면 N에서는 1, 2만 가능

점화식으로 나타내면 된다.
#+END_EXAMPLE

** 코드 - dp 배열 쓰기
#+BEGIN_SRC cpp
#include <cstdio>
#include <algorithm>
using namespace std;

int N;

int a[1010][3];
int dp[1010][3];

int main(int argc, char* argv[])
{
    scanf("%d", &N);
    for(int i=0;i<N;i++) {
        scanf("%d %d %d", &a[i][0], &a[i][1], &a[i][2]);
    }
    dp[0][0] = a[0][0];
    dp[0][1] = a[0][1];
    dp[0][2] = a[0][2];

    for(int i=1;i<N;i++) {
        dp[i][0] = min(dp[i-1][1], dp[i-1][2]) + a[i][0];
        dp[i][1] = min(dp[i-1][0], dp[i-1][2]) + a[i][1];
        dp[i][2] = min(dp[i-1][0], dp[i-1][1]) + a[i][2];        
    }
    printf("%d\n", min(min(dp[N-1][0], dp[N-1][1]), dp[N-1][2]));
    return 0;
}
#+END_SRC

** 코드 - 변수를 적게 쓰기
#+BEGIN_SRC cpp
#include <cstdio>
#include <algorithm>
using namespace std;

int N;

int a[2][3];
int dp[2][3];

int main(int argc, char* argv[])
{
    freopen("input.txt", "r", stdin);
    scanf("%d", &N);
    for(int i=0;i<N;i++) {


        if (i == 0) {
          scanf("%d %d %d", &a[0][0], &a[0][1], &a[0][2]);

          dp[0][0] = a[0][0];
          dp[0][1] = a[0][1];
          dp[0][2] = a[0][2];
        } else {
                scanf("%d %d %d", &a[1][0], &a[1][1], &a[1][2]);

                dp[1][0] = min(dp[0][1], dp[0][2]) + a[1][0];
                dp[1][1] = min(dp[0][0], dp[0][2]) + a[1][1];
                dp[1][2] = min(dp[0][0], dp[0][1]) + a[1][2];        

                a[0][0] = a[1][0];
                a[0][1] = a[1][1];
                a[0][2] = a[1][2];

                dp[0][0] = dp[1][0];
                dp[0][1] = dp[1][1];                
                dp[0][2] = dp[1][2];                                
        }
    }

    if (N %2 == 0)
        printf("%d\n", min(min(dp[0][0], dp[0][1]), dp[0][2]));
    else
        printf("%d\n", min(min(dp[1][0], dp[1][1]), dp[1][2]));    
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/1149
