_posts/2021-12-27-boj-1149.html
---
title: BOJ 1149 RBG 거리
tags: DP
---

<div id="outline-container-orgfe4b1bc" class="outline-2">
<h2 id="orgfe4b1bc">BOJ 1149 RGB 거리</h2>
<div class="outline-text-2" id="text-orgfe4b1bc">
<ul class="org-ul">
<li>DP용 문제</li>
</ul>
</div>
</div>

<div id="outline-container-org87c8d26" class="outline-2">
<h2 id="org87c8d26">접근하기</h2>
<div class="outline-text-2" id="text-org87c8d26">
<pre class="example">
dp[N][0] dp[N][1] dp[N][2]   -&gt; 각 집마다의 색깔

N+1이 0이면 N에서는 1, 2만 가능

N+1이 1이면 N에서는 0, 2만 가능

N+1이 2이면 N에서는 1, 2만 가능

점화식으로 나타내면 된다.
</pre>
</div>
</div>

<div id="outline-container-org20162a5" class="outline-2">
<h2 id="org20162a5">코드 - dp 배열 쓰기</h2>
<div class="outline-text-2" id="text-org20162a5">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[1010][3];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[1010][3];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;a[i][0], &amp;a[i][1], &amp;a[i][2]);
    }
    dp[0][0] = a[0][0];
    dp[0][1] = a[0][1];
    dp[0][2] = a[0][2];

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N;i++) {
        dp[i][0] = min(dp[i-1][1], dp[i-1][2]) + a[i][0];
        dp[i][1] = min(dp[i-1][0], dp[i-1][2]) + a[i][1];
        dp[i][2] = min(dp[i-1][0], dp[i-1][1]) + a[i][2];        
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, min(min(dp[N-1][0], dp[N-1][1]), dp[N-1][2]));
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb84fea" class="outline-2">
<h2 id="orgdb84fea">코드 - 변수를 적게 쓰기</h2>
<div class="outline-text-2" id="text-orgdb84fea">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[2][3];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[2][3];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {


        <span style="color: #729fcf; font-weight: bold;">if</span> (i == 0) {
          scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;a[0][0], &amp;a[0][1], &amp;a[0][2]);

          dp[0][0] = a[0][0];
          dp[0][1] = a[0][1];
          dp[0][2] = a[0][2];
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
                scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;a[1][0], &amp;a[1][1], &amp;a[1][2]);

                dp[1][0] = min(dp[0][1], dp[0][2]) + a[1][0];
                dp[1][1] = min(dp[0][0], dp[0][2]) + a[1][1];
                dp[1][2] = min(dp[0][0], dp[0][1]) + a[1][2];        

                a[0][0] = a[1][0];
                a[0][1] = a[1][1];
                a[0][2] = a[1][2];

                dp[0][0] = dp[1][0];
                dp[0][1] = dp[1][1];                
                dp[0][2] = dp[1][2];                                
        }
    }

    <span style="color: #729fcf; font-weight: bold;">if</span> (N %2 == 0)
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, min(min(dp[0][0], dp[0][1]), dp[0][2]));
    <span style="color: #729fcf; font-weight: bold;">else</span>
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, min(min(dp[1][0], dp[1][1]), dp[1][2]));    
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4390e2c" class="outline-2">
<h2 id="org4390e2c">문제 링크</h2>
<div class="outline-text-2" id="text-org4390e2c">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1149">https://www.acmicpc.net/problem/1149</a></li>
</ul>
</div>
</div>
